In [3]:
import pandas as pd
import numpy as np

1. Write a program to create a dataframe from list of lists

In [3]:
data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]

In [6]:
db1= pd.DataFrame(data,columns=['Name','Age'])

In [7]:
db1

  Name  Age
0  Joy   21
1  Mia   15
2  Sam   14

2. Extract the second word from the given string

In [8]:
sentence = 'Be confident and be yourself'

In [12]:
sentence.split()[1]

'confident'

3. Split the 'Name' column into two separate columns as First_Name and Last_Name

Name	Salary
Emma Larter	3200
Mia Junior	4500
Sophia Depp	3600
James Smith	5596

In [19]:
data=pd.DataFrame({'Name':['Emma Lartner', 'Mia junior', 'Sophia Deep', 'James Smith'], 'Age':[3200,4500,3600,5596]})

In [20]:
data

           Name   Age
0  Emma Lartner  3200
1    Mia junior  4500
2   Sophia Deep  3600
3   James Smith  5596

In [25]:
data[['First Name','Last Name']]=data['Name'].str.split(expand=True)
data

           Name   Age First Name Last Name  First_Name  Last_Name
0  Emma Lartner  3200       Emma   Lartner         NaN        NaN
1    Mia junior  4500        Mia    junior         NaN        NaN
2   Sophia Deep  3600     Sophia      Deep         NaN        NaN
3   James Smith  5596      James     Smith         NaN        NaN

	
4. Select the rows from below dataframe where marks are less than 60

Name	Marks
John	90
Robert	50
Jonny	89
Mia	55

In [30]:
data1=pd.DataFrame({'Name':['John','Robert','Jonny','Mia'],'Marks':[30,50,89,55]})

In [31]:
data1

     Name  Marks
0    John     30
1  Robert     50
2   Jonny     89
3     Mia     55

In [33]:
data1.get(data1.Marks<60)

     Name  Marks
0    John     30
1  Robert     50
3     Mia     55

5. Write a program to select the rows where the sales are higher than 60000 for Mumbai

In [14]:
df_store=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
          'Location':['Mumbai','Pune','Heydrabad','Mumbai','Pune','Delhi','Heydrabad','Pune','Mumbai','Pune'],
         'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})

In [8]:
df_store[(df_store['Location']=='Mumbai') & (df_store['Sales'] > 60000)]

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

6. Write a program to select stores located in Hyderabad

In [9]:
df_store

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45000
2     A  Heydrabad  50000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Heydrabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [14]:
df_store[(df_store['Location']=='Heydrabad')]['Store']

2    A
6    D
Name: Store, dtype: object

7. Write a program to replace the 'Store' column with the values A, B, C, and D with Store_A, Store_B, Store_C and Store_D respectively

In [18]:
df_store['Store']=df_store['Store'].replace({'A':'Store_A','B':'Store_B','C':'Store_C','D':'Store_D'})

In [19]:
df_store

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45000
2  Store_A  Heydrabad  50000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Heydrabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

8. Create a dataframe in pandas using the given list.
Use the below list

    city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']

In [21]:
city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']

df_city=pd.DataFrame(city,columns=['City'])

In [22]:
df_city

      City
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

9.Save a given dataframe to a csv file

In [24]:
df_store.to_csv('df_store.csv')

10. Find the maximum sales for each store

In [25]:
df_store.groupby('Store')['Sales'].max()

Store
Store_A    87000
Store_B    70000
Store_C    90000
Store_D    89000
Name: Sales, dtype: int64

In [30]:
df_store.pivot_table(df_store,index=['Store'],aggfunc='max')

        Location  Sales
Store
Store_A     Pune  87000
Store_B     Pune  70000
Store_C   Mumbai  90000
Store_D     Pune  89000

11. Write a program to select all columns, except the 'Location' from the given dataframe

In [32]:
df_store[df_store.columns[df_store.columns != 'Location']]

     Store  Sales
0  Store_A  40000
1  Store_B  45000
2  Store_A  50000
3  Store_C  90000
4  Store_D  89000
5  Store_A  87000
6  Store_D  85000
7  Store_A  78000
8  Store_C  89000
9  Store_B  70000

12. Write a program to insert a given column at the second position in a dataframe

In [4]:
data =pd.DataFrame({'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]})
Salary = [35000, 24000, 55000, 40000]

In [5]:
data.insert(loc=1,column='Salary',value=Salary)

In [6]:
data

          Name  Salary  Age
0  Emma Larter   35000   34
1   Mia Junior   24000   59
2  Sophia Depp   55000   32
3  James Smith   40000   40

13. Write a program to get the third observation of the given dataframe

In [8]:
data.iloc[2]

Name      Sophia Depp
Salary          55000
Age                32
Name: 2, dtype: object

14. Write a program to create a dataframe from the provided lists
Use the following lists to create your arrays:

        columns = ["Science", "Maths", "English"]

        marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]

In [10]:
columns = ["Science", "Maths", "English"]

marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]

In [11]:
pd.DataFrame(marks,columns=columns)

   Science  Maths  English
0       55     78       88
1       93     63       83
2       94     74       64

15. Write a program to count total sales per store

In [16]:
df_store.groupby('Store')['Sales'].sum()

Store
A    255000
B    115000
C    179000
D    174000
Name: Sales, dtype: int64

In [22]:
df_store.pivot_table(df_store,index='Store',aggfunc='sum')

        Sales
Store
A      255000
B      115000
C      179000
D      174000

16. Write a program to count the top five commonly used words in a list

In [25]:
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall',
                    'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 
                    'there', 'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

In [31]:
pd.Series(words_list).value_counts().head()

where     7
will      6
shall     4
we        4
should    3
dtype: int64

In [42]:
wdic={}
for i in words_list:
    if i not in wdic:
        wdic[i]=1
    else:
        wdic[i]=wdic[i]+1
print(wdic)

{'words': 2, 'will': 6, 'where': 7, 'shall': 4, 'we': 4, 'there': 2, 'wow': 1, 'should': 3, 'now': 1}

17. Write a program to sort the dataframe by 'Sales' in ascending order

In [48]:
df_store.sort_values(by='Sales')

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45000
2     A  Heydrabad  50000
9     B       Pune  70000
7     A       Pune  78000
6     D  Heydrabad  85000
5     A      Delhi  87000
4     D       Pune  89000
8     C     Mumbai  89000
3     C     Mumbai  90000

18. Write a program to sort the dataframe by 'Store' in ascending order and by 'Sales' in descending order simultaneously

In [52]:
df_store.sort_values(by=['Sales','Store'],ascending=[False,False])

  Store   Location  Sales
3     C     Mumbai  90000
4     D       Pune  89000
8     C     Mumbai  89000
5     A      Delhi  87000
6     D  Heydrabad  85000
7     A       Pune  78000
9     B       Pune  70000
2     A  Heydrabad  50000
1     B       Pune  45000
0     A     Mumbai  40000

	
19. Create a column 'Rank_sales' which contains the rank of each store based on sales of the product in ascending order

In [53]:
df_store['Rank_Sales']=df_store.groupby('Store')['Sales'].rank(ascending=True)

In [54]:
df_store

  Store   Location  Sales  Rank_Sales
0     A     Mumbai  40000         1.0
1     B       Pune  45000         1.0
2     A  Heydrabad  50000         2.0
3     C     Mumbai  90000         2.0
4     D       Pune  89000         2.0
5     A      Delhi  87000         4.0
6     D  Heydrabad  85000         1.0
7     A       Pune  78000         3.0
8     C     Mumbai  89000         1.0
9     B       Pune  70000         2.0

In [57]:
df_store.sort_values(by='Store')

  Store   Location  Sales  Rank_Sales
0     A     Mumbai  40000         1.0
2     A  Heydrabad  50000         2.0
5     A      Delhi  87000         4.0
7     A       Pune  78000         3.0
1     B       Pune  45000         1.0
9     B       Pune  70000         2.0
3     C     Mumbai  90000         2.0
8     C     Mumbai  89000         1.0
4     D       Pune  89000         2.0
6     D  Heydrabad  85000         1.0

20.Rank the dataframe in descending order of sales by each store

In [58]:
df_store['Rank Sales2']=df_store.groupby('Store')['Sales'].rank(ascending=False)

In [59]:
df_store.sort_values('Store')

  Store   Location  Sales  Rank_Sales  Rank Sales2
0     A     Mumbai  40000         1.0          4.0
2     A  Heydrabad  50000         2.0          3.0
5     A      Delhi  87000         4.0          1.0
7     A       Pune  78000         3.0          2.0
1     B       Pune  45000         1.0          2.0
9     B       Pune  70000         2.0          1.0
3     C     Mumbai  90000         2.0          1.0
8     C     Mumbai  89000         1.0          2.0
4     D       Pune  89000         2.0          1.0
6     D  Heydrabad  85000         1.0          2.0